{"config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activation": "linear", "nb_row": 9, "W_constraint": null, "input_dtype": "float32", "bias": true, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 8, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "batch_input_shape": [null, 100, 100, 1], "subsample": [1, 1], "nb_col": 9, "name": "convolution2d_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_row": 7, "W_constraint": null, "bias": true, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_2", "nb_filter": 16, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 7, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_row": 5, "W_constraint": null, "bias": true, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_3", "nb_filter": 32, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 5, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_3"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "bias": true, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_4"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "bias": true, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_5", "nb_filter": 250, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "input_dim": null, "init": "glorot_uniform", "output_dim": 2}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_6"}}], "class_name": "Sequential", "keras_version": "1.1.2"}